Revit 2027 API
SpotLightDistribution Class
 This class encapsulates a spot light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.SpotLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpotLightDistribution : LightDistribution
Public Class SpotLightDistribution
	Inherits LightDistribution
public ref class SpotLightDistribution : public LightDistribution
type SpotLightDistribution =
    class
        inherit LightDistribution
    end
The SpotLightDistribution type exposes the following members.
Constructors
Name | Description
SpotLightDistribution() |  Creates a spot light distribution object with the following values;
PI/6 radians spot beam angle
PI/2 radians spot field angle
PI/6 radians tilt angle
SpotLightDistribution(SpotLightDistribution) |  Creates a copy of the given spotlight distribution
SpotLightDistribution(Double, Double, Double) |  Creates a spot light distribution object with the given values.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightDistribution)
SpotBeamAngle |  The spot beam angle.
SpotFieldAngle |  The spot field angle.
TiltAngle |  The tilt angle.
Top
Methods
Name | Description
Clone |  Creates a copy of the LightDistribution derived object.
(Inherited from LightDistribution)
Dispose
(Inherited from LightDistribution)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace